emacsConf/.emacs.d/newConfig.org
#+TITLE: Ashfaq Farooqui's Emacs Configuration
#+AUTHOR: Ashfaq Farooqui
#+EMAIL: ashfaq.farooqui@gmail.com
e+OPTIONS: toc:3 num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />

* User Details
#+begin_src emacs-lisp
     (setq user-full-name "Ashfaq Farooqui")
     (setq user-mail-address "ashfaq.farooqui@gmail.com")
#+end_src
* Package Management
Since Emacs 24, Emacs includes the Emacs Lisp Package Archive
([[http://www.emacswiki.org/emacs/ELPA][ELPA]]) by default. This provides a nice way to install additional
packages. Since the default package archive doesn't include
everything necessary, the [[http://marmalade-repo.org/][marmalade]], and [[http://melpa.milkbox.net/#][melpa]] repositories are also
added.
#+begin_src emacs-lisp
     (load "package")
    (package-initialize)
    (add-to-list 'package-archives
                 '("marmalade" . "http://marmalade-repo.org/packages/"))
    (add-to-list 'package-archives
                 '("melpa" . "http://melpa.milkbox.net/packages/") t)
    (add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/"))
    (add-to-list 'package-archives
                '("elpy" . "http://jorgenschaefer.github.io/packages/"))
    (setq package-archive-enable-alist '(("melpa" magit f)))
    (require 'cl)
#+end_src
** Define default packages
#+BEGIN_SRC emacs-lisp
  (defvar ashfaq/packages '(ac-slime
   auto-complete
   graphviz-dot-mode
   magit
   org
   flycheck
   flyspell
   flyspell-correct
   flyspell-correct-helm
   helm-flyspell
   powerline
   helm
   helm-projectile
   ensime
   multiple-cursors
   find-file-in-repository
   yasnippet
   neotree
   rainbow-delimiters
   projectile
   evil
   org-bullets
   bind-key
   zenburn-theme
   writeroom-mode;;darkroom
   which-key
   elpy
   color-theme-sanityinc-tomorrow
   latex-preview-pane
   helm-mu
   pdf-tools
   org-ref
   auctex
   use-package
   auctex-latexmk
   writegood-mode
   )
   "Default packages")

#+END_SRC
** Install default packages

When Emacs boots, check to make sure all of the packages defined
in =ashfaq/packages= are installed. If not, have ELPA take care of
it.
#+begin_src emacs-lisp
      (defun ashfaq/packages-installed-p ()
        (loop for pkg in ashfaq/packages
              when (not (package-installed-p pkg)) do (return nil)
              finally (return t)))

      (unless (ashfaq/packages-installed-p)
        (message "%s" "Refreshing package database...")
        (package-refresh-contents)
        (dolist (pkg ashfaq/packages)
          (when (not (package-installed-p pkg))
            (package-install pkg))))
#+end_src
* Load secrets
#+BEGIN_SRC emacs-lisp
;  (require 'secrets "~/.emacs.d/secrets.el.gpg")
#+END_SRC
* Some mandatory stuff
** Adding default folders
#+BEGIN_SRC emacs-lisp
(defvar my/emacs-cache (concat user-emacs-directory ".cache/")
  "Folder to store cache files in.

Should end with a forward slash.")

(setq custom-file (concat my/emacs-cache "customize.el"))
(setq bookmark-default-file (concat my/emacs-cache "bookmarks"))
(setq recentf-save-file (concat my/emacs-cache "recentf"))

#+END_SRC

** Enable system notification
#+BEGIN_SRC emacs-lisp
(use-package alert
  :ensure t
  :config
  (if (executable-find "notify-send")
      (setq alert-default-style 'libnotify)))

#+END_SRC
** Splash Screen

I want to skip straight to the scratch buffer. This turns off the
splash screen and puts me straight into the scratch buffer. I
don't really care to have anything in there either, so turn off
the message while we're at it. Since I end up using =org-mode=
most of the time, set the default mode accordingly.

#+begin_src emacs-lisp
      (setq inhibit-splash-screen t
            initial-scratch-message nil
            initial-major-mode 'org-mode)
#+end_src
** Scroll bar, Tool bar, Menu bar
Emacs starts up with way too much enabled. Configure the scroll bar,
menu bar, and tool bar. There isn't really a reason to have them
on.
#+begin_src emacs-lisp
      (scroll-bar-mode 1)
      (tool-bar-mode -1)
      (menu-bar-mode 1)
#+end_src
** Marking text
There are some behaviors in Emacs that aren't intuitive. Since I
pair with others that don't know how Emacs handles highlighting,
treat regions like other text editors. This means typing when the
mark is active will write over the marked region. Also, make the
common highlighting keystrokes work the way most people expect
them to. This saves a lot of time explaining how to highlight
areas of text. Emacs also has it's own clipboard and doesn't
respond to the system clipboard by default, so tell Emacs that
we're all friends and can get along.
#+begin_src emacs-lisp
      (delete-selection-mode t)
      (transient-mark-mode t)
      (setq x-select-enable-clipboard t)
#+end_src
** Display Settings
I have some modifications to the default display. First, a
minor tweak to the frame title. It's also nice to be able to see
when a file actually ends. This will put empty line markers into
the left hand side.
#+begin_src emacs-lisp
      (setq-default indicate-empty-lines t)
      (when (not indicate-empty-lines)
        (toggle-indicate-empty-lines))
#+end_src
** Indentation
There's nothing I dislike more than tabs in my files. Make sure I
don't share that discomfort with others.
#+begin_src emacs-lisp
   (setq tab-width 4
         indent-tabs-mode nil)
#+end_src
** Backup files
Save backups in another folder
#+begin_src emacs-lisp
  (setq backup-by-copying t      ; don't clobber symlinks
        backup-directory-alist
        '(("." . "~/.emacs.d/backups/emacs-saves"))    ; don't litter my fs tree
        delete-old-versions t
        kept-new-versions 6
        kept-old-versions 2
        version-control t)       ; use versioned backups
#+end_src
** Yes and No
Nobody likes to have to type out the full yes or no when Emacs
asks. Which it does often. Make it one character.
#+begin_src emacs-lisp
      (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src
** Key bindings
Miscellaneous key binding stuff that doesn't fit anywhere else.
#+begin_src emacs-lisp
;; (global-set-key (kbd "RET") 'newline-and-indent)
(global-set-key (kbd "C-;") 'comment-or-uncomment-region)
(global-set-key (kbd "M-/") 'hippie-expand)
(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "C-c C-k") 'compile)
(global-set-key (kbd "C-x g") 'magit-status)
(global-set-key (kbd "S-z") 'undo)
(global-set-key (kbd "M-g") 'goto-line) ; [Ctrl-l]
(global-set-key (kbd "C-L") 'recenter-top-bottom)
(global-set-key [f2] 'split-window-horizontally)
(global-set-key [f1] 'remove-split)
(global-set-key (kbd "C-x 9") 'split-window-horizontally)
(global-set-key (kbd "s--") 'split-window-vertically)
(global-set-key (kbd "s-+") 'remove-split)
(global-set-key (kbd "s-<up>") 'enlarge-window)
(global-set-key (kbd "s-<down>") 'shrink-window)
(global-set-key (kbd "s-<right>") 'enlarge-window-horizontally)
(global-set-key (kbd "s-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "M-k") 'kill-whole-line)
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
(global-set-key (kbd "C->") 'mc/mark-next-like-this)
(global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)

#+end_src
** Misc
Turn down the time to echo keystrokes so I don't have to wait
around for things to happen. Dialog boxes are also a bit annoying,
so just have Emacs use the echo area for everything. Beeping is
for robots, and I am not a robot. Use a visual indicator instead
of making horrible noises. Oh, and always highlight parentheses. A
person could go insane without that.
#+begin_src emacs-lisp
    (setq echo-keystrokes 0.1
          use-dialog-box nil
          visible-bell t)
    (show-paren-mode t)
  (global-hl-line-mode)
(blink-cursor-mode -1)


(defun dcaps-to-scaps ()
  "Convert word in DOuble CApitals to Single Capitals."
  (interactive)
  (and (= ?w (char-syntax (char-before)))
       (save-excursion
         (and (if (called-interactively-p)
                  (skip-syntax-backward "w")
                (= -3 (skip-syntax-backward "w")))
              (let (case-fold-search)
                (looking-at "\\b[[:upper:]]\\{2\\}[[:lower:]]"))
              (capitalize-word 1)))))

(define-minor-mode dubcaps-mode
  "Toggle `dubcaps-mode'.  Converts words in DOuble CApitals to
Single Capitals as you type."
  :init-value nil
  :lighter (" DC")
  (if dubcaps-mode
      (add-hook 'post-self-insert-hook #'dcaps-to-scaps nil 'local)
    (remove-hook 'post-self-insert-hook #'dcaps-to-scaps 'local)))

(add-hook 'text-mode-hook #'dubcaps-mode)
#+end_src
** Evil Mode
#+begin_src emacs-lisp
     (use-package evil
  :ensure t
  :config
  (evil-mode 1)

  (use-package evil-leader
    :ensure t
    :config
    (global-evil-leader-mode))

  (use-package evil-surround
    :ensure t
    :config
    (global-evil-surround-mode))

  (use-package evil-indent-textobject
    :ensure t)
(progn
    (evil-ex-define-cmd "e[dit]" 'helm-find-files)
    (evil-ex-define-cmd "b[uffer]" 'helm-buffers-list)
    (bind-key "[escape]" 'keyboard-escape-quit evil-normal-state-map)
    (bind-key "[escape]" 'keyboard-escape-quit evil-visual-state-map)
    (bind-key "<escape>" 'keyboard-escape-quit)))
#+end_src
* Utilities
** Helm
#+BEGIN_SRC emacs-lisp
(require 'helm-config)
(global-set-key (kbd "M-x") 'helm-M-x)
(helm-mode 1)
(use-package ibuffer-vc
:ensure t)
(defalias 'list-buffers 'ibuffer-other-window) 
#+END_SRC

#+RESULTS:
: list-buffers

** Ido
=Ido= mode provides a nice way to navigate the filesystem. This is
mostly just turning it on.
#+begin_src emacs-lisp
      (ido-mode t)
      (setq ido-enable-flex-matching t
            ido-use-virtual-buffers t)
#+end_src
** Column number mode
Turn on column numbers.
#+begin_src emacs-lisp
      (setq column-number-mode t)
#+end_src
