emacsConf/.emacs.d/newConfig.org
** Temporary file management
Deal with temporary files. I don't care about them and this makes
them go away.
#+begin_src emacs-lisp
      (setq backup-directory-alist `((".*" . ,temporary-file-directory)))
      (setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))
#+end_src
** autopair-mode
This makes sure that brace structures =(), [], {}=, etc. are closed
as soon as the opening character is typed.
#+begin_src emacs-lisp
      (use-package autopair
           :ensure t)
      ;(require 'autopair)
      (autopair-global-mode)
#+end_src
** Company mode                                                  :ToInclude:
#+BEGIN_SRC emacs-lisp

(add-to-list 'exec-path "/usr/local/bin")
(use-package company
  :ensure t
  :bind
  (:map company-active-map
        ("C-s" . company-search-candidates)
        ("<tab>" . company-complete-common-or-cycle)
        ("RET" . company-complete-selection)
        ("C-n" . company-select-next)
        ("C-p" . company-select-previous))
  :init
  (add-hook 'after-init-hook #'global-company-mode)
  :config
  (setq company-minimum-prefix-length 2)
  (setq company-idle-delay 0.5)
  (setq company-require-match nil)
  (use-package company-statistics
    :ensure t
    :config
    (setq company-statistics-file
          (concat my/emacs-cache "company-statistics-cache.el"))
    (add-hook 'company-mode-hook #'company-statistics-mode))
  (use-package company-math
    :ensure t
    :config
    (add-to-list 'company-backends 'company-math-symbols-latex))
  (use-package company-quickhelp
    :ensure t
    :config
    (company-quickhelp-mode))
  (use-package company-flx
    :ensure t
    :init
    (with-eval-after-load 'company
      (company-flx-mode +1)))
  (use-package company-web-html
    :ensure company-web)
  (use-package company-shell
    :ensure t
    :config
    (add-to-list 'company-backends 'company-shell)))

(add-hook 'after-init-hook 'global-company-mode)
#+END_SRC
** Indentation and buffer cleanup                                :toInclude:
Setup org mode indentation
#+BEGIN_SRC emacs-lisp
(setq org-startup-indented t)
(use-package aggressive-indent
  :ensure t
  :config
  (global-aggressive-indent-mode)
  )
#+END_SRC
This re-indents, untabifies, and cleans up whitespace. It is stolen
directly from the emacs-starter-kit.
#+begin_src emacs-lisp
      (defun untabify-buffer ()
        (interactive)
        (untabify (point-min) (point-max)))

      (defun indent-buffer ()
        (interactive)
        (indent-region (point-min) (point-max)))

      (defun cleanup-buffer ()
        "Perform a bunch of operations on the whitespace content of a buffer."
        (interactive)
        (indent-buffer)
        (untabify-buffer)
        (delete-trailing-whitespace))

      (defun cleanup-region (beg end)
        "Remove tmux artifacts from region."
        (interactive "r")
        (dolist (re '("\\\\│\·*\n" "\W*│\·*"))
          (replace-regexp re "" nil beg end)))

      (global-set-key (kbd "C-x M-t") 'cleanup-region)
      (global-set-key (kbd "C-c n") 'cleanup-buffer)

      (setq-default show-trailing-whitespace t)
#+end_src

Indent stuff, copied from [[https://www.emacswiki.org/emacs/IndentingText]]

#+BEGIN_SRC emacs-lisp
 (defun shift-region (distance)
  (let ((mark (mark)))
    (save-excursion
      (indent-rigidly (region-beginning) (region-end) distance)
      (push-mark mark t t)
      ;; Tell the command loop not to deactivate the mark
      ;; for transient mark mode
      (setq deactivate-mark nil))))

(defun shift-right ()
  (interactive)
  (shift-region 1))

(defun shift-left ()
  (interactive)
  (shift-region -1))

;; Bind (shift-right) and (shift-left) function to your favorite keys. I use
;; the following so that Ctrl-Shift-Right Arrow moves selected text one
;; column to the right, Ctrl-Shift-Left Arrow moves selected text one
;; column to the left:

(global-set-key [C-S-right] 'shift-right)
(global-set-key [C-S-left] 'shift-left)
#+END_SRC
** flyspell
The built-in Emacs spell checker. Turn off the welcome flag because
it is annoying and breaks on quite a few systems. Specify the
location of the spell check program so it loads properly.
#+begin_src emacs-lisp
  (setq flyspell-issue-welcome-flag nil)
      (setq-default ispell-program-name "/usr/local/bin/aspell")
    (setq-default ispell-program-name "/usr/bin/aspell")
  (setq-default ispell-list-command "list")

#+end_src
** eshell
Customize eshell

#+begin_src emacs-lisp
      (require 'f)

      (setq eshell-visual-commands
            '("less" "tmux" "htop" "top" "bash" "zsh" "fish"))

      (setq eshell-visual-subcommands
            '(("git" "log" "l" "diff" "show")))

      ;; Prompt with a bit of help from http://www.emacswiki.org/emacs/EshellPrompt
      (defmacro with-face (str &rest properties)
        `(propertize ,str 'face (list ,@properties)))

      (defun eshell/abbr-pwd ()
        (let ((home (getenv "HOME"))
              (path (eshell/pwd)))
          (cond
           ((string-equal home path) "~")
           ((f-ancestor-of? home path) (concat "~/" (f-relative path home)))
           (path))))

      (defun eshell/my-prompt ()
        (let ((header-bg "#161616"))
          (concat
      ;     (with-face user-login-name :foreground "#dc322f")
      ;     (with-face (concat "@" hostname) :foreground "#268bd2")
      ;     " "
           (with-face (eshell/abbr-pwd) :foreground "#008700")
           (if (= (user-uid) 0)
               (with-face "#" :foreground "red")
             (with-face "$" :foreground "#2345ba"))
           " ")))

      (setq eshell-prompt-function 'eshell/my-prompt)
      (setq eshell-highlight-prompt nil)
      (setq eshell-prompt-regexp "^[^#$\n]+[#$] ")

      (setq eshell-cmpl-cycle-completions nil)
#+end_src
** powerline

#+begin_src emacs-lisp
  (require 'powerline)
  (powerline-default-theme)
#+end_src

** Neo tree
#+begin_src emacs-lisp
      (require 'neotree)
      (global-set-key [f8] 'neotree-toggle)
    (setq neo-smart-open t)
  (defun neotree-project-dir ()
    "Open NeoTree using the git root."
    (interactive)
    (let ((project-dir (projectile-project-root))
          (file-name (buffer-file-name)))
      (neotree-toggle)
      (if project-dir
          (if (neo-global--window-exists-p)
              (progn
                (neotree-dir project-dir)
                (neotree-find file-name)))
        (message "Could not find git project root."))))

 (global-set-key [f8] 'neotree-project-dir)

(setq neo-theme (if (display-graphic-p) 'icons 'arrow))
#+end_src

** Dired
#+BEGIN_SRC emacs-lisp
(use-package dired+
  :ensure t
  :config (require 'dired+)
  )
#+END_SRC
** Peep files using dired
#+BEGIN_SRC emacs-lisp
  ;;preview files in dired
  (use-package peep-dired
    :ensure t
    :defer t ; don't access `dired-mode-map' until `peep-dired' is loaded
    :bind (:map dired-mode-map
                ("P" . peep-dired)))
  (evil-define-key 'normal peep-dired-mode-map (kbd "<SPC>") 'peep-dired-scroll-page-down
                                               (kbd "C-<SPC>") 'peep-dired-scroll-page-up
                                               (kbd "<backspace>") 'peep-dired-scroll-page-up
                                               (kbd "j") 'peep-dired-next-file
                                               (kbd "k") 'peep-dired-prev-file)
  (add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+END_SRC
** Volatile highlight
#+BEGIN_SRC emacs-lisp
(use-package volatile-highlights
:ensure t  
:config
  (volatile-highlights-mode t))
#+END_SRC
** Move text
#+BEGIN_SRC emacs-lisp
(use-package move-text
  :ensure t
  :bind
  (([(meta shift up)] . move-text-up)
   ([(meta shift down)] . move-text-down)))
#+END_SRC
** Line numbers
#+BEGIN_SRC emacs-lisp
(use-package linum
  :config
  (add-hook 'prog-mode-hook
            '(lambda () (linum-mode 1))))

#+END_SRC
** org-protocol
#+BEGIN_SRC emacs-lisp

(require 'org-protocol)


#+END_SRC
* Setup scala and 
