emacsConf/.emacs.d/newConfig.el
  ;; Start ensime mode whenever we open scala mode, e.g. open a .scala file
  (add-hook 'scala-mode-hook 'ensime-scala-mode-hook)
  ;; Start ensime with Super-e
  (global-set-key (kbd "C-c C-c c") 'ensime)
  ;; Configuration for ensime
  (setq ensime-sem-high-faces
    '(
       (implicitConversion nil)
       (var . (:foreground "#ff2222"))
       (val . (:foreground "#dddddd"))
       (varField . (:foreground "#ff3333"))
       (valField . (:foreground "#dddddd"))
       (functionCall . (:foreground "#dc9157"))
       (param . (:foreground "#ffffff"))
       (object . (:foreground "#D884E3"))
       (class . (:foreground "green"))
       (trait . (:foreground "#009933"))
       (operator . (:foreground "#cc7832"))
       (object . (:foreground "#6897bb" :slant italic))
       (package . (:foreground "yellow"))
       (implicitConversion . (:underline (:style wave :color "blue")))
       (implicitParams . (:underline (:style wave :color "blue")))
       (deprecated . (:strike-through "#a9b7c6"))
       (implicitParams nil)
     )
    ensime-completion-style 'company
    ensime-sem-high-enabled-p nil ;; disable semantic highlighting
    ensime-tooltip-hints t ;; disable type-inspecting tooltips
    ensime-tooltip-type-hints t ;; disable typeinspecting tooltips
)
(setq ido-enable-flex-matching t)
(setq ido-everywhere t)
(ido-mode 1)
(setq ido-use-filename-at-point 'guess)
(setq ido-create-new-buffer 'always)
(setq ido-file-extensions-order '(".scala" ".org" ".txt" ".py" ".emacs" ".xml" ".el" ".ini" ".cfg" ".cnf"))

(defun search-to-brace ()
  "Jump to the next open brace"
  (interactive)
  (search-forward "{"))
(define-key global-map (kbd "M-s {") 'search-to-brace)

(defun search-to-prev-brace ()
    "Jump to the previous brace"
    (interactive)
    (search-backward "{"))
(define-key global-map (kbd "M-S {") 'search-to-prev-brace)

(defun search-to-close-brace ()
  "Jump to the next close brace"
  (interactive)
  (search-forward "}"))
(define-key global-map (kbd "M-s }") 'search-to-close-brace)

(defun search-to-prev-close-brace ()
  "Jump to the previous close brace"
  (interactive)
  (search-backward "}"))
(define-key global-map (kbd "M-S }") 'search-to-prev-brace)

(defun search-to-next-def ()
  "Jump to the next def"
  (interactive)
  (search-forward "def "))
(define-key global-map (kbd "M-s d") 'search-to-next-def)

(defun search-to-prev-def ()
  "Jump to the previous def"
  (interactive)
  (search-backward "def "))
(define-key global-map (kbd "M-S d") 'search-to-prev-def)

;; Save on focus-out
(defun save-all ()
  (interactive)
  (save-some-buffers t))
(add-hook 'focus-out-hook 'save-all)

(defun scala-mode-newline-comments ()
  "Custom newline appropriate for `scala-mode'."
  ;; shouldn't this be in a post-insert hook?
  (interactive)
  (newline-and-indent)
  (scala-indent:insert-asterisk-on-multiline-comment))

(bind-key "RET" 'scala-mode-newline-comments scala-mode-map)

(setq comment-start "/* "
          comment-end " */"
          comment-style 'multi-line
          comment-empty-lines t)

(add-hook 'scala-mode-hook
          (lambda ()
            (show-paren-mode)
;            (smartparens-mode)
            (yas-minor-mode)
            (git-gutter-mode)
;            (company-mode)
            (ensime-mode)
            (scala-mode:goto-start-of-code)))

(setq org-directory "~/Dropbox/orgs")

(defun org-file-path (filename)
  "Return the absolute address of an org file, given its relative name."
  (concat (file-name-as-directory org-directory) filename))

(setq org-inbox-file
      (concat (org-file-path "inbox.org")))
(setq org-index-file (org-file-path "index.org"))
(setq org-archive-location
      (concat (org-file-path "archive.org") "::* From %s"))

(setq org-todo-keywords '((sequence
                   "TODO(t)"  ; next action
                   "STARTED(s)"
                   "WAITING(w@/!)"
                   "SOMEDAY(.)" "|" "DONE(x!)" "CANCELLED(c@)")
                  (sequence "TODELEGATE(-)" "DELEGATED(d)" "|" "COMPLETE(x)")
                   (sequence "IDEA"))
       org-todo-keyword-faces '(("IDEA" . (:foreground "green" :weight bold))
                                     ("STARTED" . (:foreground "blue" :weight bold))
                                     ("CANCELLED" . (:foreground "red" :weight book))
                                     ("SOMEDAY" . (:foreground "red" :weight book))
                                     ("WAITING" . (:foreground "yellow" :weight book))
                                     ("COMPLETE" . (:foreground "green" :weight bold))
                                     ("DONE" . (:foreground "green" :weight bold))))



                 (setq org-log-done t)
                    (add-hook 'org-mode-hook
                              (lambda ()
                                (flyspell-mode)))
                    (add-hook 'org-mode-hook
                              (lambda ()
                                (writegood-mode)))
  (add-hook 'LaTeX-mode-hook (lambda () (writegood-mode)))
(add-hook 'LaTeX-mode-hook (lambda () (flyspell-mode)))

(add-hook 'org-mode-hook
          (lambda ()
            (org-bullets-mode t)))

(setq org-ellipsis "⤵")

(setq org-src-fontify-natively t)

(setq org-src-tab-acts-natively t)

(setq org-src-window-setup 'current-window)

(add-hook 'org-capture-mode-hook 'evil-insert-state)

(setq org-pretty-entities          t ; UTF8 all the things!
      org-support-shift-select     t ; holding shift and moving point should select things
      org-M-RET-may-split-line     nil ; M-RET may never split a line
      org-enforce-todo-dependencies t ; can't finish parent before children
      org-enforce-todo-checkbox-dependencies t ; can't finish parent before children
      org-hide-emphasis-markers t ; make words italic or bold, hide / and *
      org-catch-invisible-edits 'error ; don't let me edit things I can't see
      org-startup-indented t) ; start with indentation setup
(setq org-startup-with-inline-images t) ; show inline images
(setq org-log-done t)
(setq org-goto-interface (quote outline-path-completion))
(use-package htmlize
  :ensure t)
(setq org-special-ctrl-a/e t)

(require 'ob)
