emacsConf/.emacs.d/newConfig.el

(org-babel-do-load-languages
 'org-babel-load-languages
 '((sh . t)
   (dot . t)
   (ruby . t)
   (js . t)
   (C . t)
   (ledger .t)
   (scala . t)))

(add-to-list 'org-src-lang-modes (quote ("dot". graphviz-dot)))
(add-to-list 'org-babel-tangle-lang-exts '("clojure" . "clj"))

(defvar org-babel-default-header-args:clojure
  '((:results . "silent") (:tangle . "yes")))

(defun org-babel-execute:clojure (body params)
  (lisp-eval-string body)
  "Done!")

(provide 'ob-clojure)

(setq org-src-fontify-natively t
      org-confirm-babel-evaluate nil)

(add-hook 'org-babel-after-execute-hook (lambda ()
                                          (condition-case nil
                                              (org-display-inline-images)
                                            (error nil)))
          'append)

(setq org-agenda-files (list org-directory))
(setq org-agenda-include-diary t)
(setq org-agenda-include-all-todo t)

(defun mark-done-and-archive ()
  "Mark the state of an org-mode item as DONE and archive it."
  (interactive)
  (org-todo "DONE")
  (org-archive-subtree))

(define-key global-map "\C-c\C-x\C-s" 'mark-done-and-archive)
(setq org-log-done 'time)

(setq org-capture-templates
             (quote ( ("a" "Appointment" entry (file  (org-file-path "gcal.org"))
          "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")

  ("t" "todo work" entry (file+headline "Phd Notebook.org" "Tasks")
  "* TODO %a %?\nSCHEDULE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))")

               ("b" "Blog idea"
                entry
                (file (org-file-path "blog-ideas.org"))
                "* TODO %?\n")

               ("p" "Phd Notes"
                entry
                (file (org-file-path "Phd Notebook.org")))

               ("R" "Random Notes"
                entry
                (file org-index-file)
                "* %?\n"))))

;; (setq ledger-expense-completions
;;      (list
;;       "" ;; needed for first | for mapconcat
;;       "Income:Salary"
;;       "Assets:Savings" "Assets:Checking"
;;       "Expenses:Dining" "Expenses:ToIndia" "Expenses:Additional" "Expenses:Groceries" "Expenses:Rent" "Expenses:Outfit:Apparel" "Expenses:Outfit:Accessories" "Expenses:Goods" "Expenses:Electronics:Gadgets" "Expenses:Phone" "Expenses:Tools" "Expenses:Transport" "Expenses:Entertainment"
;;       "Liabilities:ChalmersCard"
;;       ))
;;
;;
;;   (setq capture-expense-template
;;         "%%(org-read-date) * %%^{What}
;;       %%^{Expenses%s}  %%^{Amount}
;;       %%^{Assets%s}")
;;
;;   (setq capture-income-template
;;         "%%(org-read-date) * Salary
;;       Assets:Checking  %%^{Amount}
;;       Income:Salary")
;;
;;   (setq capture-credit-template
;;         "%%(org-read-date) * %%^{What}
;;       %%^{Expense%s}  %%^{Amount}
;;       Liabilities:ChalmersCard")
;;
;;   (setq capture-transfer-template
;;         "%%(org-read-date) * %%^{What}
;;       %%^{Assets%s}  %%^{Amount}
;;       %%^{Assets%s}")
;;
;;defun return-capture-expense-template ()
;;   (let ((compstring
;;          (mapconcat 'identity ledger-expense-completions  "|" )))
;; (format capture-expense-template compstring compstring)))
;;
;;defun return-capture-credit-template ()
;;   (let ((compstring
;;          (mapconcat 'identity ledger-expense-completions  "|" )))
;; (format capture-credit-template compstring compstring))
;; )
;;defun return-capture-income-template ()
;;   (let ((compstring
;;          (mapconcat 'identity ledger-expense-completions  "|" )))
;; (format capture-income-template compstring compstring))
;; )
;;defun return-capture-transfer-template ()
;;   (let ((compstring
;;          (mapconcat 'identity ledger-expense-completions  "|" )))
;; (format capture-transfer-template compstring compstring))
;; )
;;
;;setq org-capture-templates
;;       (append '(("l" "Ledger entries")
;;                 ("ls" "Spending" plain
;;                 (file "~/Dropbox/orgs/Accounts/finances.ledger")
;;                 (function return-capture-expense-template)
;;                 :empty-lines-before 1
;;                 :empty-lines-after 1)
;;                 ("lc" "Credit" plain
;;                 (file "~/Dropbox/orgs/Accounts/finances.ledger")
;;                 (function return-capture-credit-template)
;;                 :empty-lines-before 1
;;                 :empty-lines-after 1)
;;                 ("li" "Income" plain
;;                 (file "~/Dropbox/orgs/Accounts/finances.ledger")
;;                 (function return-capture-income-template)
;;                 :empty-lines-before 1
;;                 :empty-lines-after 1)
;;                 ("lt" "Transfer" plain
;;                 (file "~/Dropbox/orgs/Accounts/finances.ledger")
;;                 (function return-capture-transfer-template)
;;                 :empty-lines-before 1
;;                 :empty-lines-after 1)
;;
;;org-capture-templates))
;;

(add-hook 'org-capture-mode-hook 'evil-insert-state)

(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(define-key global-map "\C-cc" 'org-capture)

(require 'which-key)
(which-key-mode)
(which-key-setup-side-window-bottom)

(projectile-mode)

(require 'flycheck)

(flycheck-define-checker proselint
  "A linter for prose."
  :command ("proselint" source-inplace)
  :error-patterns
  ((warning line-start (file-name) ":" line ":" column ": "
            (id (one-or-more (not (any " "))))
            (message (one-or-more not-newline)
                     (zero-or-more "\n" (any " ") (one-or-more not-newline)))
            line-end))
  :modes (text-mode markdown-mode gfm-mode org-mode))

(add-to-list 'flycheck-checkers 'proselint)

(add-hook 'text-mode-hook #'flycheck-mode)
(add-hook 'org-mode-hook #'flycheck-mode)
(add-hook 'LaTeX-mode-hook #'flycheck-mode)

(require 'flyspell-correct-helm)
(define-key flyspell-mode-map (kbd "C-;") 'flyspell-correct-previous-word-generic)

(add-hook 'text-mode-hook 'turn-on-auto-fill)
(add-hook 'org-mode-hook 'turn-on-auto-fill)

;;    (require 'tex-mik)
