emacsConf/.emacs.d/newConfig.org
** Latex Config
#+BEGIN_SRC emacs-lisp
   ;;    (require 'tex-mik)
       (setq TeX-auto-save t)
       (setq TeX-parse-self t)
       (setq-default TeX-master nil)
       (add-hook 'LaTeX-mode-hook 'visual-line-mode)
       (add-hook 'LaTeX-mode-hook 'flyspell-mode)
       (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
       (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
       (setq reftex-plug-into-AUCTeX t)
  (require 'auctex-latexmk)
     (auctex-latexmk-setup)
      ; (require 'auto-complete-auctex)
     (setq auctex-latexmk-inherit-TeX-PDF-mode t)
    ;   (setq TeX-PDF-mode t)
#+END_SRC
** Syntex with evince
#+BEGIN_SRC emacs-lisp
(require 'dbus)

(defun un-urlify (fname-or-url)
  "A trivial function that replaces a prefix of file:/// with just /."
  (if (string= (substring fname-or-url 0 8) "file:///")
     (substring fname-or-url 7)
    fname-or-url))

(defun th-evince-sync (file linecol &rest ignored)
  (let* ((fname (un-urlify file))
         (buf (find-buffer-visiting fname))
         (line (car linecol))
         (col (cadr linecol)))
    (if (null buf)
        (message "[Synctex]: %s is not opened..." fname)
      (switch-to-buffer buf)
      (goto-line (car linecol))
      (unless (= col -1)
        (move-to-column col)))))

(defvar *dbus-evince-signal* nil)

(defun enable-evince-sync ()
  (require 'dbus)
  (when (and
         (eq window-system 'x)
         (fboundp 'dbus-register-signal))
    (unless *dbus-evince-signal*
      (setf *dbus-evince-signal*
            (dbus-register-signal
             :session nil "/org/gnome/evince/Window/0"
             "org.gnome.evince.Window" "SyncSource"
             'th-evince-sync)))))

(add-hook 'LaTeX-mode-hook 'enable-evince-sync)

#+END_SRC
** Markdown
#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "markdown"))

#+END_SRC
** lang tool
#+BEGIN_SRC emacs-lisp
(use-package langtool
:ensure t
:config 
(setq langtool-language-tool-jar "~/.emacs.d/vendor/langtool/languagetool-commandline.jar")
(setq langtool-default-language "en-US")
(setq langtool-java-classpath nil))  
#+END_SRC
** Synonyms
#+BEGIN_SRC emacs-lisp
(use-package synosaurus
:ensure t
:config
(setq synosaurus-choose-method 'popup))
#+END_SRC
** Dictionary
#+BEGIN_SRC emacs-lisp
(use-package helm-dictionary
:ensure t)
#+END_SRC
** Babel to translate
#+BEGIN_SRC emacs-lisp


#+END_SRC
* Theme
#+BEGIN_SRC emacs-lisp
(require 'color-theme-sanityinc-tomorrow)
(load-theme 'sanityinc-tomorrow-night t)
#+END_SRC
* Python
#+BEGIN_SRC emacs-lisp
(elpy-enable)
(elpy-use-ipython)
#+END_SRC
* Library -- org-ref
** Basic config
#+BEGIN_SRC emacs-lisp
(require 'doi-utils)
(require 'org-ref-wos)
(require 'org-ref-scopus)
(require 'org-ref-isbn)
(require 'org-ref-arxiv)
(require 'org-ref-sci-id)
(require 'x2bib)
(require 'org-ref-latex)
(require 'org-ref-pdf)
(require 'org-ref-url-utils)
(setq reftex-default-bibliography '("~/Library/MasterReferences.bib"))

;; see org-ref for use of these variables
(setq org-ref-bibliography-notes "~/Library/notes.org"
      org-ref-default-bibliography '("~/Library/MasterReferences.bib")
      org-ref-pdf-directory "~/Library/bibtex-pdfs/")

#+END_SRC
** To open pdfs
#+BEGIN_SRC emacs-lisp
(defun my/org-ref-open-pdf-at-point ()
  "Open the pdf for bibtex key under point if it exists."
  (interactive)
  (let* ((results (org-ref-get-bibtex-key-and-file))
         (key (car results))
         (pdf-file (car (bibtex-completion-find-pdf key))))
    (if (file-exists-p pdf-file)
        (org-open-file pdf-file)
      (message "No PDF found for %s" key))))

(setq org-ref-open-pdf-function 'my/org-ref-open-pdf-at-point)

#+END_SRC
* PDF tools
** Pdf tool setup
#+BEGIN_SRC emacs-lisp
  (use-package pdf-tools
   :pin manual ;; manually update
   :config
   ;; open pdfs scaled to fit page
   (setq-default pdf-view-display-size 'fit-page)
   ;; automatically annotate highlights
   (setq pdf-annot-activate-created-annotations t)
   ;; use normal isearch
   (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward))
(add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
  (add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-tools-install))
#+END_SRC
* Ledger mode
#+BEGIN_SRC emacs-lisp
    (use-package ledger-mode
      :ensure t
      :init
      (setq ledger-clear-whole-transactions 1)
      :mode ("\\.ledger$" . ledger-mode)
    :init
    (defvar my/ledger-file
      (expand-file-name "~/Dropbox/orgs/Accounts/finances.ledger")
      "Where the ledger journal is kept.")
    (setq file-ledger "finances.ledger")
      :config
      (add-to-list 'evil-emacs-state-modes 'ledger-report-mode)
    (setq ledger-post-amount-alignment-column 70)
     (setq ledger-post-amount-alignment-at :decimal)
     ;; There is a correct way to write dates:
     ;; https://xkcd.com/1179/
     (setq ledger-use-iso-dates t)
   (setq ledger-reports '(("on-hand" "ledger -f %(ledger-file) --color bal \"(Assets:Checking|Savings|Liabilities)\"")
                          ("bal" "ledger -f %(ledger-file) --color bal")
                          ("reg" "ledger -f %(ledger-file) --color reg")
                          ("payee" "ledger -f %(ledger-file) --color  reg @%(payee)")
                          ("account" "ledger -f %(ledger-file) --color reg %(account)")
                          ("budgeted" "ledger --unbudgeted --monthly register ^expenses -f %(ledger-file)")
                          ("unbudgeted" "ledger --budgeted --monthly register ^expenses -f %(ledger-file)") )))

      (setq org-capture-templates
                 (append  '(("l" "Ledger entries")
                     ("li" "income" plain (file my/ledger-file)
                      "%(org-read-date) *  %^{From?}
       Assets:Checking        SEK %^{Amount}
       Income:Salary" :empty-lines 1 :immediate-finish t)
                     ("lt" "transfer" plain (file my/ledger-file)
                      "%(org-read-date) %^{Payee}
       Assets:%^{account}        SEK %^{Amount}
       Assets:%^{account}" :empty-lines 1 :immediate-finish t)
                     ("lp" "Payment" plain (file my/ledger-file)
                      "%(org-read-date) %^{Payee}
       Expenses:%^{Expense category}        SEK %^{Amount}
       Assets:Checking" :empty-lines 1 :immediate-finish t)
                     ("ls" "pay from savings" plain (file my/ledger-file)
                      "%(org-read-date) %^{Payee}
       Expenses:%^{Expense category}        SEK %^{Amount}
       Assets:Savings" :empty-lines 1 :immediate-finish t)
                      ("lc" "pay with chalmers card" plain (file my/ledger-file)
                       "%(org-read-date) %^{Payee}
       Expenses:%^{Expense Category}       SEK %^{Amount}
       Liabilities:ChalmersCard" :empty-lines 1 :immediate-finish t ))
           org-capture-templates))

    (use-package flycheck-ledger
      :ensure t
      :init
      :mode "\\.ledger$'")
#+END_SRC

* Windmove
#+BEGIN_SRC emacs-lisp
(use-package windmove
  ;; :defer 4
  :ensure t
  :config
 (global-set-key (kbd "C-c <left>")  'windmove-left)
 (global-set-key (kbd "C-c <right>") 'windmove-right)
 (global-set-key (kbd "C-c <up>")    'windmove-up)
 (global-set-key (kbd "C-c <down>")  'windmove-down)

  ;; wrap around at edges
  (setq windmove-wrap-around t))

#+END_SRC

#+RESULTS:
: t

