emacsConf/.emacs.d/newConfig.org
* G-cal for orgs
#+BEGIN_SRC emacs-lisp
;;use-package org-gcal
;; :ensure t
;; :config
;; (setq
;;       org-gcal-file-alist '(("ashfaq.farooqui@gmail.com" .  "~/Dropbox/orgs/gcal.org"))))
;;add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
;;add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))
;;use-package calfw
;; :ensure  t;TODO:
;; :config
;; (require 'calfw)
;; (require 'calfw-org)
;; (setq cfw:org-overwrite-default-keybinding t)
;; (require 'calfw-ical)
;;
;; (defun mycalendar ()
;;   (interactive)
;;   (cfw:open-calendar-buffer
;;    :contents-sources
;;    (list
;;     ;; (cfw:org-create-source "Green")  ; orgmode source
;;     (cfw:ical-create-source "gcal" "https://calendar.google.com/calendar/ical/ashfaq.farooqui%40gmail.com/public/basic.ics" "IndianRed") ; google calendar ICS
;;     )))
;; (setq cfw:org-overwrite-default-keybinding t))
;;
;;use-package calfw-gcal
;;       :ensure t
;;       :config
;;       (require 'calfw-gcal))
#+END_SRC
* mail client                                                     :toInclude:
Need to move this to use-package later
#+BEGIN_SRC emacs-lisp
    ;(add-to-list 'load-path "~/.emacs.d/dotEmacs/mu4e")
    (require 'mu4e)
    (require 'mu4e-contrib)
    (require 'helm-mu)
    (require 'org-mu4e)
    ;; default
    (setq mu4e-maildir "~/mail")
    (setq mu4e-drafts-folder "/Drafts")
    (setq mu4e-sent-folder   "/Sent")
    (setq mu4e-trash-folder  "/Trash")
      (setq mu4e-compose-signature-auto-include t)
  (setq mu4e-compose-format-flowed t)
    ;; don't save message to Sent Messages, Gmail/IMAP takes care of this
    (setq mu4e-sent-messages-behavior 'sent)

    ;; setup some handy shortcuts
    ;; you can quickly switch to your Inbox -- press ``ji''
    ;; then, when you want archive some messages, move them to
    ;; the 'All Mail' folder by pressing ``ma''.

    (setq mu4e-maildir-shortcuts
          '( ("/Inbox"               . ?i)
             ("/Sent"   . ?s)
             ("/Drafts" . ?d)
             ("/Trash"       . ?t)
             ("/All Mail"    . ?a)))

    ;; allow for updating mail using 'U' in the main view:
    (setq mu4e-update-interval 600)
    (setq mu4e-get-mail-command "mbsync chalmers")

    ;; something about ourselves
    (setq
     user-mail-address "ashfaqf@chalmers.se"
     user-full-name  "Ashfaq Farooqui"
     message-signature
     (concat
      "//Ashfaq"
      "\n"))
    (setq mu4e-compose-signature t)
    ;; sending mail -- replace USERNAME with your gmail username
    ;; also, make sure the gnutls command line utils are installed
    ;; package 'gnutls-bin' in Debian/Ubuntu

    (require 'smtpmail)
    (setq message-send-mail-function 'smtpmail-send-it
        smtpmail-auth-credentials
      (expand-file-name "~/.emacs.d/.authinfo.gpg")
        smtpmail-default-smtp-server "localhost"
        smtpmail-smtp-server "localhost"
        smtpmail-smtp-service 1025)

    ;; don't keep message buffers around
    (setq message-kill-buffer-on-exit t)
    ;;store org-mode links to messages
    ;;store link to message if in header view, not to header query
    (setq org-mu4e-link-query-in-headers-mode nil)



    ;;; Html rendering
    (setq mu4e-view-prefer-html t)

    (setq mu4e-use-fancy-chars t)
    (setq mu4e-attachment-dir "~/Documents/mail")


    ;;; Attempt to show images when viewing messages
    (setq mu4e-view-show-images t
          mu4e-view-image-max-width 800)

    ;; View html message in firefox (type aV)
    (add-to-list 'mu4e-view-actions
                '("ViewInBrowser" . mu4e-action-view-in-browser) t)

  ;; PGP-Sign all e-mails
  (add-hook 'message-send-hook 'mml-secure-message-sign-pgpmime)

#+END_SRC

#+RESULTS:
| mml-secure-message-sign-pgpmime |

* Spotify
#+BEGIN_SRC emacs-lisp
(use-package helm-spotify-plus
:ensure t)


#+END_SRC
* Google translate
#+BEGIN_SRC emacs-lisp
(use-package google-translate
  :ensure t
  :bind
  (:map mu4e-view-mode-map
        ("C-c t" . google-translate-at-point))
  :config
  (setq google-translate-default-target-language "English")
  ;; It won't ask for the input language. If I need it to, call the
  ;; translation command with a C-u prefix:
  (setq google-translate-default-source-language "Swedish"))

#+END_SRC
* CSV files
#+BEGIN_SRC emacs-lisp
(use-package csv-mode
  :ensure t
  :mode (("\\.csv" . csv-mode)))

#+END_SRC
* Elfeed              
#+BEGIN_SRC  emacs-lisp
  (use-package elfeed
    :ensure t
    :bind
    (:map elfeed-search-mode-map
          ("s" . bjm/elfeed-load-db-and-open)
          ("q" . bjm/elfeed-save-db-and-bury))
    :init
    ;; thanks - http://pragmaticemacs.com/emacs/read-your-rss-feeds-in-emacs-with-elfeed/
    ;; though slightly modified
    ;; functions to support syncing .elfeed between machines
    ;; makes sure elfeed reads index from disk before launching
    (defun bjm/elfeed-load-db-and-open ()
      "Load the elfeed db from disk before opening."
      (interactive)
      (elfeed-db-load)
      (elfeed)
      (elfeed-search-update--force)
      (elfeed-update))
    ;;write to disk when quiting
    (defun bjm/elfeed-save-db-and-bury ()
      "Wrapper to save the elfeed db to disk before burying buffer"
      (interactive)
      (elfeed-db-save)
      (quit-window))
    :config
    (setq elfeed-db-directory "~/Dropbox/.elfeed")
    ;; This lets me get the http links to entries with org-capture
    ;; easily.
    (defun elfeed-entry-as-html-link ()
      "Store an http link to an elfeed entry"
      (when (equal major-mode 'elfeed-show-mode)
        (let ((description (elfeed-entry-title elfeed-show-entry))
              (link (elfeed-entry-link elfeed-show-entry)))
          (org-store-link-props
           :type "http"
           :link link
           :description description))))
    (org-link-set-parameters "elfeed" :follow #'browse-url :store #'elfeed-entry-as-html-link))
  (evil-define-key* 'motion elfeed-search-mode-map
                    "U" #'elfeed-search-update--force
                    "u" #'elfeed-search-fetch)

  (evil-define-key* 'motion elfeed-show-mode-map
                    "j" #'elfeed-show-next
                    "k" #'elfeed-show-prev)
  (add-to-list 'evil-motion-state-modes 'elfeed-search-mode)
  (add-to-list 'evil-motion-state-modes 'elfeed-show-mode)
  (use-package elfeed-goodies
  :ensure t)


  (use-package elfeed-org
    :ensure t
    :config
    (progn
      (elfeed-org)
      (setq rmh-elfeed-org-files (list "~/.emacs.d/elfeed.org"))))
#+END_SRC
* pocket
#+BEGIN_SRC emacs-lisp
(use-package pocket-reader
  :ensure t)

#+END_SRC
* Diff Highlights
#+BEGIN_SRC emacs-lisp
(use-package git-gutter+
  :ensure t
  :init
  (global-git-gutter+-mode)
  :config
  (setq git-gutter+-modified-sign "¤"))
#+END_SRC
* org-board
#+BEGIN_SRC emacs-lisp
(use-package org-board
:ensure t
)

#+END_SRC
* Restart emacs
#+BEGIN_SRC emacs-lisp
(use-package restart-emacs
:ensure t)

#+END_SRC
* Dashboard
#+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)
;; Set the title
(setq dashboard-banner-logo-title "Welcome to Emacs Dashboard")
;; Set the banner
(setq dashboard-startup-banner 'official)
;; Value can be
;; 'official which displays the official emacs logo
;; 'logo which displays an alternative emacs logo
;; 1, 2 or 3 which displays one of the text banners
;; "path/to/your/image.png which displays whatever image you would prefer
(setq dashboard-items '((recents  . 5)
                        (bookmarks . 5)
                        (projects . 5)
                        (agenda . 2)
                        (registers . 2)))
)
#+END_SRC
* Perspectives
#+BEGIN_SRC emacs-lisp
(use-package perspective
:ensure t)

#+END_SRC
* Org web tools
#+BEGIN_SRC emacs-lisp
(use-package org-web-tools
:ensure t)
#+END_SRC
* Org-toc
#+BEGIN_SRC emacs-lisp
(use-package toc-org
:ensure t)
(add-hook 'org-mode-hook 'toc-org-enable)

#+END_SRC
* Jedi
#+BEGIN_SRC emacs-lisp
(use-package jedi
:ensure t
:init
(add-hook 'python-mode-hook 'jedi:setup)
(setq jedi:setup-keys t) ; optional
(setq jedi:complete-on-dot t) ; optional
)
#+END_SRC
* Jupyter
#+BEGIN_SRC emacs-lisp
(use-package ein
:ensure t
:config
)

(use-package ein
:ensure t
:init
(require 'ein)
(require 'ein-dev)
(require 'auto-complete)
(require 'jedi)
(setq ein:completion-backend 'ein:use-ac-jedi-backend)
(setq ein:complete-on-dot t)

:config
(highlight-indentation-mode t)
)


#+END_SRC
* Alert
#+BEGIN_SRC emacs-lisp
(alert "Emacs has started")

#+END_SRC
